// Package datrus - библиотека для работы с различными идентификаторами и реквизитами, принятыми в РФ.
//
// Поддерживаемые типы данных:
//   - BankAccount - детальная структура банковского счета
//   - BIC - БИК, банковский идентификационный код
//   - INN - ИНН, индивидуальный номер налогоплательщика
//   - KPP - КПП, код причины постановки на учет налогоплательщиков-организаций
//   - SNILS - СНИЛС, страховой номер индивидуального лицевого счета в системе обязательного пенсионного страхования
package datrus
