// Package dict - справочники.
//   - AccountCode — справочник кодов счетов первого и второго порядка ("план счетов") согласно Положению №385-П ЦБ РФ
//     "О правилах ведения бухгалтерского учета в кредитных организациях, расположенных
//     на территории Российской Федерации"
//   - Currency — справочник кодов валют "ОК (МК (ИСО 4217) 003-97) 014-2000. Общероссийский классификатор валют"
//   - KPPReason — справочник "Причины постановки на учет налогоплательщиков-организаций" (СППУНО)
//   - Region — справочник субъектов Российской Федерации с кодами ОКАТО и ОКТМО
package dict
