package dict

var regionIdxCode = make(map[string]*Region)  // Индекс по коду региона.
var regionIdxOKATO = make(map[string]*Region) // Индекс по ОКАТО.
var regionIdxOKTMO = make(map[string]*Region) // Индекс по ОКТМО.

func init() {
	// Построение индексов
	for i, r := range regionDict {
		if r.Code != "" {
			regionIdxCode[r.Code] = &regionDict[i]
		}
		if r.OKATO != "" {
			regionIdxOKATO[r.OKATO] = &regionDict[i]
		}
		if r.OKTMO != "" {
			regionIdxOKTMO[r.OKTMO] = &regionDict[i]
		}
	}
}

// regionDict - справочник субъектов Российской Федерации с кодами ОКАТО и ОКТМО.
//
// Источники:
//
//   - https://www.nalog.gov.ru/rn77/program/5961292/
//   - https://rosstat.gov.ru/opendata/7708234640-7708234640-okato
//   - https://rosstat.gov.ru/opendata/7708234640-oktmo
//
// Актуальность справочников:
//   - 2022-10-05: Справочник субъектов Российской Федерации
//   - 2023-11-01: Общероссийский классификатор объектов административно-территориального деления (ОКАТО)
//   - 2023-11-01: Общероссийский классификатор территорий муниципальных образований (ОКТМО)
var regionDict = []Region{
	{Code: "01", OKATO: "79000000000", OKTMO: "79000000000", Title: "Республика Адыгея (Адыгея)"},
	{Code: "02", OKATO: "80000000000", OKTMO: "80000000000", Title: "Республика Башкортостан"},
	{Code: "03", OKATO: "81000000000", OKTMO: "81000000000", Title: "Республика Бурятия"},
	{Code: "04", OKATO: "84000000000", OKTMO: "84000000000", Title: "Республика Алтай"},
	{Code: "05", OKATO: "82000000000", OKTMO: "82000000000", Title: "Республика Дагестан"},
	{Code: "06", OKATO: "26000000000", OKTMO: "26000000000", Title: "Республика Ингушетия"},
	{Code: "07", OKATO: "83000000000", OKTMO: "83000000000", Title: "Кабардино-Балкарская Республика"},
	{Code: "08", OKATO: "85000000000", OKTMO: "85000000000", Title: "Республика Калмыкия"},
	{Code: "09", OKATO: "91000000000", OKTMO: "91000000000", Title: "Карачаево-Черкесская Республика"},
	{Code: "10", OKATO: "86000000000", OKTMO: "86000000000", Title: "Республика Карелия"},
	{Code: "11", OKATO: "87000000000", OKTMO: "87000000000", Title: "Республика Коми"},
	{Code: "12", OKATO: "88000000000", OKTMO: "88000000000", Title: "Республика Марий Эл"},
	{Code: "13", OKATO: "89000000000", OKTMO: "89000000000", Title: "Республика Мордовия"},
	{Code: "14", OKATO: "98000000000", OKTMO: "98000000000", Title: "Республика Саха (Якутия)"},
	{Code: "15", OKATO: "90000000000", OKTMO: "90000000000", Title: "Республика Северная Осетия - Алания"},
	{Code: "16", OKATO: "92000000000", OKTMO: "92000000000", Title: "Республика Татарстан (Татарстан)"},
	{Code: "17", OKATO: "93000000000", OKTMO: "93000000000", Title: "Республика Тыва"},
	{Code: "18", OKATO: "94000000000", OKTMO: "94000000000", Title: "Удмуртская Республика"},
	{Code: "19", OKATO: "95000000000", OKTMO: "95000000000", Title: "Республика Хакасия"},
	{Code: "20", OKATO: "96000000000", OKTMO: "96000000000", Title: "Чеченская Республика"},
	{Code: "21", OKATO: "97000000000", OKTMO: "97000000000", Title: "Чувашская Республика - Чувашия"},
	{Code: "22", OKATO: "01000000000", OKTMO: "01000000000", Title: "Алтайский край"},
	{Code: "23", OKATO: "03000000000", OKTMO: "03000000000", Title: "Краснодарский край"},
	{Code: "24", OKATO: "04000000000", OKTMO: "04000000000", Title: "Красноярский край"},
	{Code: "25", OKATO: "05000000000", OKTMO: "05000000000", Title: "Приморский край"},
	{Code: "26", OKATO: "07000000000", OKTMO: "07000000000", Title: "Ставропольский край"},
	{Code: "27", OKATO: "08000000000", OKTMO: "08000000000", Title: "Хабаровский край"},
	{Code: "28", OKATO: "10000000000", OKTMO: "10000000000", Title: "Амурская область"},
	{Code: "29", OKATO: "11000000000", OKTMO: "11000000000", Title: "Архангельская область"},
	{Code: "30", OKATO: "12000000000", OKTMO: "12000000000", Title: "Астраханская область"},
	{Code: "31", OKATO: "14000000000", OKTMO: "14000000000", Title: "Белгородская область"},
	{Code: "32", OKATO: "15000000000", OKTMO: "15000000000", Title: "Брянская область"},
	{Code: "33", OKATO: "17000000000", OKTMO: "17000000000", Title: "Владимирская область"},
	{Code: "34", OKATO: "18000000000", OKTMO: "18000000000", Title: "Волгоградская область"},
	{Code: "35", OKATO: "19000000000", OKTMO: "19000000000", Title: "Вологодская область"},
	{Code: "36", OKATO: "20000000000", OKTMO: "20000000000", Title: "Воронежская область"},
	{Code: "37", OKATO: "24000000000", OKTMO: "24000000000", Title: "Ивановская область"},
	{Code: "38", OKATO: "25000000000", OKTMO: "25000000000", Title: "Иркутская область"},
	{Code: "39", OKATO: "27000000000", OKTMO: "27000000000", Title: "Калининградская область"},
	{Code: "40", OKATO: "29000000000", OKTMO: "29000000000", Title: "Калужская область"},
	{Code: "41", OKATO: "30000000000", OKTMO: "30000000000", Title: "Камчатский край"},
	{Code: "42", OKATO: "32000000000", OKTMO: "32000000000", Title: "Кемеровская область - Кузбасс"},
	{Code: "43", OKATO: "33000000000", OKTMO: "33000000000", Title: "Кировская область"},
	{Code: "44", OKATO: "34000000000", OKTMO: "34000000000", Title: "Костромская область"},
	{Code: "45", OKATO: "37000000000", OKTMO: "37000000000", Title: "Курганская область"},
	{Code: "46", OKATO: "38000000000", OKTMO: "38000000000", Title: "Курская область"},
	{Code: "47", OKATO: "41000000000", OKTMO: "41000000000", Title: "Ленинградская область"},
	{Code: "48", OKATO: "42000000000", OKTMO: "42000000000", Title: "Липецкая область"},
	{Code: "49", OKATO: "44000000000", OKTMO: "44000000000", Title: "Магаданская область"},
	{Code: "50", OKATO: "46000000000", OKTMO: "46000000000", Title: "Московская область"},
	{Code: "51", OKATO: "47000000000", OKTMO: "47000000000", Title: "Мурманская область"},
	{Code: "52", OKATO: "22000000000", OKTMO: "22000000000", Title: "Нижегородская область"},
	{Code: "53", OKATO: "49000000000", OKTMO: "49000000000", Title: "Новгородская область"},
	{Code: "54", OKATO: "50000000000", OKTMO: "50000000000", Title: "Новосибирская область"},
	{Code: "55", OKATO: "52000000000", OKTMO: "52000000000", Title: "Омская область"},
	{Code: "56", OKATO: "53000000000", OKTMO: "53000000000", Title: "Оренбургская область"},
	{Code: "57", OKATO: "54000000000", OKTMO: "54000000000", Title: "Орловская область"},
	{Code: "58", OKATO: "56000000000", OKTMO: "56000000000", Title: "Пензенская область"},
	{Code: "59", OKATO: "57000000000", OKTMO: "57000000000", Title: "Пермский край"},
	{Code: "60", OKATO: "58000000000", OKTMO: "58000000000", Title: "Псковская область"},
	{Code: "61", OKATO: "60000000000", OKTMO: "60000000000", Title: "Ростовская область"},
	{Code: "62", OKATO: "61000000000", OKTMO: "61000000000", Title: "Рязанская область"},
	{Code: "63", OKATO: "36000000000", OKTMO: "36000000000", Title: "Самарская область"},
	{Code: "64", OKATO: "63000000000", OKTMO: "63000000000", Title: "Саратовская область"},
	{Code: "65", OKATO: "64000000000", OKTMO: "64000000000", Title: "Сахалинская область"},
	{Code: "66", OKATO: "65000000000", OKTMO: "65000000000", Title: "Свердловская область"},
	{Code: "67", OKATO: "66000000000", OKTMO: "66000000000", Title: "Смоленская область"},
	{Code: "68", OKATO: "68000000000", OKTMO: "68000000000", Title: "Тамбовская область"},
	{Code: "69", OKATO: "28000000000", OKTMO: "28000000000", Title: "Тверская область"},
	{Code: "70", OKATO: "69000000000", OKTMO: "69000000000", Title: "Томская область"},
	{Code: "71", OKATO: "70000000000", OKTMO: "70000000000", Title: "Тульская область"},
	{Code: "72", OKATO: "71000000000", OKTMO: "71000000000", Title: "Тюменская область"},
	{Code: "73", OKATO: "73000000000", OKTMO: "73000000000", Title: "Ульяновская область"},
	{Code: "74", OKATO: "75000000000", OKTMO: "75000000000", Title: "Челябинская область"},
	{Code: "75", OKATO: "76000000000", OKTMO: "76000000000", Title: "Забайкальский край"},
	{Code: "76", OKATO: "78000000000", OKTMO: "78000000000", Title: "Ярославская область"},
	{Code: "77", OKATO: "45000000000", OKTMO: "45000000000", Title: "город федерального значения Москва"},
	{Code: "78", OKATO: "40000000000", OKTMO: "40000000000", Title: "город федерального значения Санкт-Петербург"},
	{Code: "79", OKATO: "99000000000", OKTMO: "99000000000", Title: "Еврейская автономная область"},
	{Code: "83", OKATO: "11100000000", OKTMO: "11800000000", Title: "Ненецкий автономный округ"},
	{Code: "86", OKATO: "71100000000", OKTMO: "71800000000", Title: "Ханты-Мансийский автономный округ - Югра"},
	{Code: "87", OKATO: "77000000000", OKTMO: "77000000000", Title: "Чукотский автономный округ"},
	{Code: "89", OKATO: "71140000000", OKTMO: "71900000000", Title: "Ямало-Ненецкий автономный округ"},
	{Code: "90", OKATO: "23000000000", OKTMO: "23000000000", Title: "Запорожская область"},
	{Code: "91", OKATO: "35000000000", OKTMO: "35000000000", Title: "Республика Крым"},
	{Code: "92", OKATO: "67000000000", OKTMO: "67000000000", Title: "город федерального значения Севастополь"},
	{Code: "93", OKATO: "21000000000", OKTMO: "21000000000", Title: "Донецкая Народная Республика"},
	{Code: "94", OKATO: "43000000000", OKTMO: "43000000000", Title: "Луганская Народная Республика"},
	{Code: "95", OKATO: "74000000000", OKTMO: "74000000000", Title: "Херсонская область"},
	{Code: "99", OKATO: "", OKTMO: "", Title: "Иные территории, включая город и космодром Байконур"},
}
